Revit 2027 API
BuiltInFailures.RebarFailures.RebarIllegalBarType Property
 There is Structural Rebar present in the project that no longer meet the criteria defined in Allowable Rebar Bar types parameter. Please review all existing Structural Rebar created with this Shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarIllegalBarType { get; }
Public Shared ReadOnly Property RebarIllegalBarType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarIllegalBarType {
	FailureDefinitionId^ get ();
}
static member RebarIllegalBarType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace